<a href="https://colab.research.google.com/github/Vidushi2601/CipherSchools-DataSci-ML-Hybrid/blob/main/cipher_lecture_26.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Data cleaning and normalization

In [4]:
import pandas as pd
#load the dataset
df=pd.read_csv('samp.csv')
print(df)

      Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
1      Bob  30.0      NaN  Engineering
2  Charlie  35.0  70000.0  Engineering
3    David   NaN  60000.0           HR
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales

Identifying missing values

In [5]:
#Check for missing values
print(df.isnull().sum())

Name          0
Age           1
Salary        1
Department    0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Age         7 non-null      float64
 2   Salary      7 non-null      float64
 3   Department  8 non-null      object
dtypes: float64(2), object(2)
memory usage: 384.0+ bytes

In [7]:
#Removing rows with missing values

df_cleaned=df.dropna()
print(df_cleaned)

      Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
2  Charlie  35.0  70000.0  Engineering
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales

In [8]:
#Filling missing values
df_filled=df.fillna({'Age':df['Age'].mean(),
                     'Salary':df['Salary'].mean()
                     })
print(df_filled)

      Name        Age   Salary   Department
0    Alice  25.000000  50000.0           HR
1      Bob  30.000000  70000.0  Engineering
2  Charlie  35.000000  70000.0  Engineering
3    David  38.285714  60000.0           HR
4      Eve  28.000000  80000.0           HR
5    Frank  40.000000  55000.0        Sales
6    Grace  50.000000  85000.0        Sales
7     Hank  60.000000  90000.0        Sales

In [9]:
#Forward fill method
df_ffill=df.fillna(method='ffill')
print(df_ffill)

      Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
1      Bob  30.0  50000.0  Engineering
2  Charlie  35.0  70000.0  Engineering
3    David  35.0  60000.0           HR
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales

In [10]:
#Backward Fill Method
df_bfill=df.fillna(method='bfill')
print(df_bfill)

      Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
1      Bob  30.0  70000.0  Engineering
2  Charlie  35.0  70000.0  Engineering
3    David  28.0  60000.0           HR
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales

In [11]:
#Removing Duplicates
#First add duplicate rows
df=pd.concat([df,df.iloc[[0]],df.iloc[[1]]],ignore_index=True)
print('Before removing duplicates: \n',df)

#remove duplicates
df_no_dup=df.drop_duplicates()
print('After removing duplicates: \n',df_no_dup)

Before removing duplicates:
       Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
1      Bob  30.0      NaN  Engineering
2  Charlie  35.0  70000.0  Engineering
3    David   NaN  60000.0           HR
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales
8    Alice  25.0  50000.0           HR
9      Bob  30.0      NaN  Engineering
After removing duplicates:
       Name   Age   Salary   Department
0    Alice  25.0  50000.0           HR
1      Bob  30.0      NaN  Engineering
2  Charlie  35.0  70000.0  Engineering
3    David   NaN  60000.0           HR
4      Eve  28.0  80000.0           HR
5    Frank  40.0  55000.0        Sales
6    Grace  50.0  85000.0        Sales
7     Hank  60.0  90000.0        Sales

In [12]:
#Replacing incorrect values
df_corrected=df.replace({'Department':{'HR':'Human resources','Sales':'Sales Department'}})
print(df_corrected)

      Name   Age   Salary        Department
0    Alice  25.0  50000.0   Human resources
1      Bob  30.0      NaN       Engineering
2  Charlie  35.0  70000.0       Engineering
3    David   NaN  60000.0   Human resources
4      Eve  28.0  80000.0   Human resources
5    Frank  40.0  55000.0  Sales Department
6    Grace  50.0  85000.0  Sales Department
7     Hank  60.0  90000.0  Sales Department
8    Alice  25.0  50000.0   Human resources
9      Bob  30.0      NaN       Engineering

In [13]:
#Ensuring Consistency

#Convert all departments names to lowercase for consistency
df['Department']=df['Department'].str.lower()
print(df)

      Name   Age   Salary   Department
0    Alice  25.0  50000.0           hr
1      Bob  30.0      NaN  engineering
2  Charlie  35.0  70000.0  engineering
3    David   NaN  60000.0           hr
4      Eve  28.0  80000.0           hr
5    Frank  40.0  55000.0        sales
6    Grace  50.0  85000.0        sales
7     Hank  60.0  90000.0        sales
8    Alice  25.0  50000.0           hr
9      Bob  30.0      NaN  engineering

In [14]:
#Min max normalization
df_normalized=df.copy()
for col in ['Age','Salary']:
  df_normalized[col]=(df[col]-df[col].min())/(df[col].max()-df[col].min())
#Print orginal and normalized values
print("Original Dataframe: \n",df)
print("\nNormalized Dataframe:\n",df_normalized)

Original Dataframe:
       Name   Age   Salary   Department
0    Alice  25.0  50000.0           hr
1      Bob  30.0      NaN  engineering
2  Charlie  35.0  70000.0  engineering
3    David   NaN  60000.0           hr
4      Eve  28.0  80000.0           hr
5    Frank  40.0  55000.0        sales
6    Grace  50.0  85000.0        sales
7     Hank  60.0  90000.0        sales
8    Alice  25.0  50000.0           hr
9      Bob  30.0      NaN  engineering

Normalized Dataframe:
       Name       Age  Salary   Department
0    Alice  0.000000   0.000           hr
1      Bob  0.142857     NaN  engineering
2  Charlie  0.285714   0.500  engineering
3    David       NaN   0.250           hr
4      Eve  0.085714   0.750           hr
5    Frank  0.428571   0.125        sales
6    Grace  0.714286   0.875        sales
7     Hank  1.000000   1.000        sales
8    Alice  0.000000   0.000           hr
9      Bob  0.142857     NaN  engineering